In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('steam_per_month_review_a.csv')

In [3]:
df0 = pd.read_csv('steam_per_month_review.csv')

In [5]:
name_0=set(df0['appid'])

In [7]:
len(name_0)

8183

In [9]:
name_1 = set(df1['app_id'])

In [11]:
len(name_1)

315

In [13]:
name_combined = name_0.union(name_1)

In [14]:
len(name_combined)

8224

In [15]:
df0.head()

         time  appid  review      playtime  voted_up
0  2010-10-31     20       1    437.000000       1.0
1  2010-10-31     70       1    339.000000       1.0
2  2010-10-31     80       1   7992.000000       1.0
3  2010-10-31    240       3  14632.666667       1.0
4  2010-10-31    300       1   1684.000000       1.0

In [16]:
df1.head()

         time  app_id  review      playtime  voted_up
0  2010-11-30      70      20   1214.894737  1.000000
1  2010-11-30     240     139  50557.539568  1.000000
2  2010-11-30     420      19    826.666667  1.000000
3  2010-11-30    4000     219  66743.876712  0.995434
4  2010-11-30    8930      28  13162.214286  1.000000

In [17]:
df1.columns = ['time','appid','review','playtime','voted_up']

In [18]:
df1.head()

         time  appid  review      playtime  voted_up
0  2010-11-30     70      20   1214.894737  1.000000
1  2010-11-30    240     139  50557.539568  1.000000
2  2010-11-30    420      19    826.666667  1.000000
3  2010-11-30   4000     219  66743.876712  0.995434
4  2010-11-30   8930      28  13162.214286  1.000000

In [20]:
df_merged = df0.merge(df1, on=['time','appid'], how='outer')

In [21]:
df_merged

,time,appid,review_x,playtime_x,voted_up_x,review_y,playtime_y,voted_up_y
0,2010-10-31,20,1.0,437.000000,1.0,NaN,NaN,NaN
1,2010-10-31,70,1.0,339.000000,1.0,NaN,NaN,NaN
2,2010-10-31,80,1.0,7992.000000,1.0,NaN,NaN,NaN
3,2010-10-31,240,3.0,14632.666667,1.0,NaN,NaN,NaN
4,2010-10-31,300,1.0,1684.000000,1.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
379216,2021-01-31,1225330,NaN,NaN,NaN,1932.0,3552.997419,0.446051
379217,2021-01-31,1229490,NaN,NaN,NaN,611.0,475.193126,1.000000
379218,2021-01-31,1240210,NaN,NaN,NaN,962.0,384.567568,0.974012
379219,2021-01-31,1289310,NaN,NaN,NaN,1864.0,178.344051,0.965702
379220,2021-01-31,1291340,NaN,NaN,NaN,427.0,241.918033,0.960187

In [23]:
df_merged['x_true']=pd.notna(df_merged['review_x'])

In [24]:
df_merged['y_true']=pd.notna(df_merged['review_y'])

In [26]:
df_merged['review']=df_merged[['review_x','review_y','x_true','y_true']].apply(lambda x : x[0] if x[2] else x[1], axis=1)
df_merged['playtime']=df_merged[['playtime_x','playtime_y','x_true','y_true']].apply(lambda x : x[0] if x[2] else x[1], axis=1)
df_merged['voted_up']=df_merged[['voted_up_x','voted_up_y','x_true','y_true']].apply(lambda x : x[0] if x[2] else x[1], axis=1)

In [28]:
df_output=df_merged[['time','appid','review','playtime','voted_up']]

In [29]:
df_output.sort_values(['time','appid'], inplace=True)

ipykernel_launcher:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [30]:
df_output

              time    appid  review      playtime  voted_up
0       2010-10-31       20     1.0    437.000000  1.000000
1       2010-10-31       70     1.0    339.000000  1.000000
2       2010-10-31       80     1.0   7992.000000  1.000000
3       2010-10-31      240     3.0  14632.666667  1.000000
4       2010-10-31      300     1.0   1684.000000  1.000000
...            ...      ...     ...           ...       ...
377785  2021-04-30  1031480     5.0   1951.800000  1.000000
377786  2021-04-30  1032430    43.0    364.604651  0.744186
377787  2021-04-30  1035610     5.0    235.200000  0.800000
377788  2021-04-30  1046030    91.0    862.505495  0.923077
377789  2021-04-30  1051310     3.0    242.000000  0.666667

[379221 rows x 5 columns]

In [31]:
df_output.to_csv('steam_per_month_review_merged.csv')